# Purpose

Students have the option of using Pandas and SQL to complete this project. A Phase 1 project done completely in pandas, completely in SQL, or a mixture of the two can all be considered a fine Phase 1 project. This notebook serves as a resource for setting up an SQL database for students who wish to use SQL in their Phase 1 project.

**To create the `movies.db` database, run the code cells below.**
> The Entity Relational Diagram is below

In [10]:
from src.make_db import create_movies_db
import pandas as pd

In [11]:
create_movies_db()

imdb_title_principals table created successfully....
imdb_name_basic table created successfully....
imdb_title_crew table created successfully....
imdb_title_ratings table created successfully....
imdb_title_basics table created successfully....
imdb_title_akas table created successfully....
tn_movie_budgets table created successfully....
tmdb_movies table created successfully....
bom_movie_gross table created successfully....
rotten_tomatoes_critic_reviews table created successfully....
rotten_tomatoes_movies table created successfully....
=========================================================
Inserting data into the imdb_title_crew table....
Inserting data into the tmdb_movies table....
Inserting data into the imdb_title_akas table....
Inserting data into the imdb_title_ratings table....
Inserting data into the imdb_name_basics table....
Inserting data into the rotten_tomatoes_movies table....
Inserting data into the rotten_tomatoes_critic_reviews table....
Inserting data into the imdb_title_basics table....
Inserting data into the tn_movie_budgets table....
Inserting data into the bom_movie_gross table....
Inserting data into the imdb_title_principals table....
=========================================================
Database created successfully!
To connect to the database: open a connection using the path "data/movies.db"

![movies.db schema](images/movies_db_schema.png)

In [16]:
import sqlite3
import pandas as pd
import numpy as np

cur = conn.cursor()

In [47]:
conn = sqlite3.connect('data/movies.db')
df = pd.read_sql('''SELECT * FROM bom_movie_gross WHERE foreign_gross IS NOT NULL''',conn)
df

,idx,title,studio,domestic_gross,foreign_gross,year
0,0,Toy Story 3,BV,415000000.0,652000000,2010
1,1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,3,Inception,WB,292600000.0,535700000,2010
4,4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...,...
2032,3275,I Still See You,LGF,1400.0,1500000,2018
2033,3286,The Catcher Was a Spy,IFC,725000.0,229000,2018
2034,3309,Time Freak,Grindstone,10000.0,256000,2018
2035,3342,Reign of Judges: Title of Liberty - Concept Short,Darin Southa,93200.0,5200,2018
2036,3353,Antonio Lopez 1970: Sex Fashion & Disco,FM,43200.0,30000,2018

      domestic_gross
0        415000000.0
1        334200000.0
2        296000000.0
3        292600000.0
4        238700000.0
...              ...
3382          6200.0
3383          4800.0
3384          2500.0
3385          2400.0
3386          1700.0

[3387 rows x 1 columns]

     foreign_gross
0        652000000
1        691300000
2        664300000
3        535700000
4        513900000
...            ...
3382          None
3383          None
3384          None
3385          None
3386          None

[3387 rows x 1 columns]

In [79]:
cur.execute('''SELECT title, foreign_gross 
FROM bom_movie_gross
ORDER BY foreign_gross DESC
''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

                                           title foreign_gross
0                                       The East         99700
1                                Life's a Breeze         99700
2                                     White Lion         99600
3     Sea Rex 3D: Journey to a Prehistoric World       9900000
4                                       Le Havre       9900000
...                                          ...           ...
3382                                   The Quake          None
3383                 Edward II (2018 re-release)          None
3384                                    El Pacto          None
3385                                    The Swan          None
3386                           An Actor Prepares          None

[3387 rows x 2 columns]

In [67]:
cur.execute('''SELECT movie, domestic_gross
FROM tn_movie_budgets 
ORDER BY domestic_gross desc
''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

                             movie domestic_gross
0     AstÃƒÂ©rix aux Jeux Olympiques       $999,811
1                Gnomeo and Juliet    $99,967,670
2                Christopher Robin    $99,215,042
3                      Desert Blue        $99,147
4                         Hercules    $99,112,101
...                            ...            ...
5777          Stories of Our Lives             $0
5778                   Tin Can Man             $0
5779              Family Motocross             $0
5780                        Red 11             $0
5781          A Plague So Pleasant             $0

[5782 rows x 2 columns]

In [72]:
cur.execute('''SELECT movie, worldwide_gross
FROM tn_movie_budgets
ORDER BY worldwide_gross DESC
''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
df

                       movie worldwide_gross
0     Fifty Dead Men Walking        $997,921
1                       Duma        $994,790
2                  Insidious     $99,870,886
3                    Hellboy     $99,823,958
4                    Mad Max     $99,750,000
...                      ...             ...
5777    Stories of Our Lives              $0
5778             Tin Can Man              $0
5779        Family Motocross              $0
5780                  Red 11              $0
5781    A Plague So Pleasant              $0

[5782 rows x 2 columns]